#!/bin/bash
echo "HI ASSISTENT :)"
# clear
# echo -n "
# ___________________________________________________

#              Установка Ассистента
# ___________________________________________________

# 1) Установка Ассистента
# ___________________________________________________

# Для работы Ассистента необходимо прописать 
# ссылки Администрации в файле hosts

# 2) Заменить файл hosts с готовыми ссылками
# 3) Записать в конец файла hosts адреса Админки
# ___________________________________________________

# 4) Вывести информацию о файле hosts
# 5) Редактировать файл hosts
# ___________________________________________________

# 0) Выход из скрипта

# Введите одно допустимое значение: "
# read infoUser
# case $infoUser in
#     1)  dnf install -y dist/assistant-fstek-4.8.run;;
#     2)  cat dist/hosts > /etc/hosts;;
#     3)  cat dist/proxy/hosts >> /etc/hosts;;
#     4)  cat /etc/hosts
#         echo
#         echo -n "Вернуться назад? (y/n): "
#         read answerUser
#         if [ $answerUser = "Y" ] || [ $answerUser = "y" ]; then
#             ./sh/assistant.sh
#         else
#             exit
#         fi;;
#     5) nano /etc/hosts;;
#     0) echo "Вы вышли из скрипта."
#        exit;;
#     *) ./sh/assistant.sh
# esac